; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v4 - type_1 ?v8 - type_2)
 	      (pred_2 ?v5 - object ?v8 - type_2)
	      (pred_4 ?v4 - type_1 ?v7 - type_3)
	      (pred_1 ?v4 - type_1 ?v5 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v4 - type_1 ?v1 ?v6 - type_2)
       :precondition (and  (pred_3 ?v4 ?v1))
       :effect (and  (pred_3 ?v4 ?v6)
		     (not (pred_3 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_1 ?v3 - object ?v2 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v2) (pred_3 ?v4 ?v2) (pred_4 ?v4 ?v7))
       :effect (and (pred_1 ?v4 ?v3 ?v7)
		    (not (pred_2 ?v3 ?v2)) 
		    (not (pred_4 ?v4 ?v7))))

   (:action op_3
       :parameters (?v4 - type_1 ?v3 - object ?v2 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v3 ?v7) (pred_3 ?v4 ?v2))
       :effect (and (pred_2 ?v3 ?v2)
		    (pred_4 ?v4 ?v7)
		    (not (pred_1 ?v4 ?v3 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_06 - type_1
obj_09 obj_13 obj_01 obj_04 - type_3
obj_14 obj_08 obj_03 obj_07 - type_2
obj_11 obj_05 obj_02 obj_12 - object)
(:init
(pred_3 obj_10 obj_03)
(pred_4 obj_10 obj_09)
(pred_4 obj_10 obj_13)
(pred_3 obj_06 obj_07)
(pred_4 obj_06 obj_01)
(pred_4 obj_06 obj_04)
(pred_2 obj_11 obj_07)
(pred_2 obj_05 obj_08)
(pred_2 obj_02 obj_03)
(pred_2 obj_12 obj_14)
)
(:goal
(and
(pred_2 obj_11 obj_14)
(pred_2 obj_05 obj_07)
(pred_2 obj_02 obj_03)
(pred_2 obj_12 obj_03)
)
)

(:constraints
  (always (not (pred_3 obj_10 obj_07)))
)
)

; plan
1. (op_2 obj_10 obj_03 obj_14)
   deleted: (pred_3 obj_10 obj_03)
   added: (pred_3 obj_10 obj_14)
   goals met: 1 of 4
2. (op_1 obj_06 obj_11 obj_07 obj_04)
   deleted: (pred_2 obj_11 obj_07) (pred_4 obj_06 obj_04)
   added: (pred_1 obj_06 obj_11 obj_04)
   goals met: 1 of 4
3. (op_1 obj_10 obj_12 obj_14 obj_13)
   deleted: (pred_2 obj_12 obj_14) (pred_4 obj_10 obj_13)
   added: (pred_1 obj_10 obj_12 obj_13)
   goals met: 1 of 4
4. (op_2 obj_06 obj_07 obj_08)
   deleted: (pred_3 obj_06 obj_07)
   added: (pred_3 obj_06 obj_08)
   goals met: 1 of 4
5. (op_2 obj_10 obj_14 obj_03)
   deleted: (pred_3 obj_10 obj_14)
   added: (pred_3 obj_10 obj_03)
   goals met: 1 of 4
6. (op_1 obj_06 obj_05 obj_08 obj_01)
   deleted: (pred_2 obj_05 obj_08) (pred_4 obj_06 obj_01)
   added: (pred_1 obj_06 obj_05 obj_01)
   goals met: 1 of 4
7. (op_3 obj_10 obj_12 obj_03 obj_13)
   deleted: (pred_1 obj_10 obj_12 obj_13)
   added: (pred_2 obj_12 obj_03) (pred_4 obj_10 obj_13)
   goals met: 2 of 4
8. (op_2 obj_06 obj_08 obj_14)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_14)
   goals met: 2 of 4
9. (op_3 obj_06 obj_11 obj_14 obj_04)
   deleted: (pred_1 obj_06 obj_11 obj_04)
   added: (pred_2 obj_11 obj_14) (pred_4 obj_06 obj_04)
   goals met: 3 of 4
10. (op_2 obj_06 obj_14 obj_07)
   deleted: (pred_3 obj_06 obj_14)
   added: (pred_3 obj_06 obj_07)
   goals met: 3 of 4
11. (op_3 obj_06 obj_05 obj_07 obj_01)
   deleted: (pred_1 obj_06 obj_05 obj_01)
   added: (pred_2 obj_05 obj_07) (pred_4 obj_06 obj_01)
   goals met: 4 of 4
